/*
Реализовать класс CheckFuelComamnd и тесты к нему.
Реализовать класс BurnFuelCommand и тесты к нему.
Реализовать простейшую макрокоманду и тесты к ней. Здесь простейшая - это значит, что при выбросе исключения вся последовательность команд приостанавливает свое выполнение, а макрокоманда выбрасывает CommandException.
Реализовать команду движения по прямой с расходом топлива, используя команды с предыдущих шагов.
Реализовать команду, которая ставит в очередь другую команду. С помощью ее реалиовать длительную операцию Движение по прямой.
*/